---
type: ExternalFileReference
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ExternalFileReference

`Autodesk.Revit.DB.ExternalFileReference` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAbsolutePath | 2012 | `public ModelPath GetAbsolutePath ()` |
| Method | GetLinkedFileStatus | 2012 | `public LinkedFileStatus GetLinkedFileStatus ()` |
| Method | GetPath | 2012 | `public ModelPath GetPath ()` |
| Method | GetReferencingId | 2012 | `public ElementId GetReferencingId ()` |
| Method | IsValidExternalFileReference | 2012 | `public static bool IsValidExternalFileReference ( ExternalFileReference data )` |
| Method | IsValidPathTypeForExternalFileReference | 2012 | `public bool IsValidPathTypeForExternalFileReference ( PathType pathType )` |
| Property | ExternalFileReferenceType | 2012 | `public ExternalFileReferenceType ExternalFileReferenceType { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PathType | 2012 | `public PathType PathType { get ; }` |